using System;
using System.Collections.Generic;
using System.IO;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Celafy
{
    internal static class Images
    {
        public const string Bytes_ButtonBG = "\u0089PNG\r\n\u001a\n\0\0\0\rIHDR\0\0\u0001,\0\0\0\u0096\b\u0006\0\0\0d[µÒ\0\0\0\u0004gAMA\0\0±\u008f\vüa\u0005\0\0\0\tpHYs\0\0\u000eÃ\0\0\u000eÃ\u0001Ço¨d\0\0\u0003dIDATx^íÚAN\u0014A\u0018\u0086áY\nK\u0094\vÀ\u0005æ^j8\u0084Â\u0085T\u000e¢Ñ\v ;H$\u0081Ý\u0004ý\u007f©\u008ea\u001cuã0ý%O%Oz¦ª`ù¦º§\u0017\u007f\u001aËåò ¼,ïÊEY\u0095ï\0ÿY·¥\u001bÓ­éæ\u001c\u008c\fý{ÔægåM¹-\u009bþ9À6u{Þ\u0096½\u0091¥Í£6\u001c\u0095\u008f¥ÿè¾\\\u008dÏ\0O¡\u009bÓíéÏ\u009fÊÑÈÓãÑ\vårl¼\u0019W\u0080]\u0098\u001aÔM:\u001e\u0099z\u00185Ñ·\u0081ÓÉêz\\\u0001vijQ\u009f´~Ý\u001eÖ\u0097~fÕ\vNVÀ\u009cLM:\u009dbÕ¿\u0006öC®é¾\u0011`NºMwåE\a«\u007fFìI\u000fØ\u00819\u009aÚôº\u0083Õï>¬o\0\u0098\u009b\u000f\u001d¬~akÓ\"À\u009c|í`y\u0083\u001dH°ê`mZ\0\u0098\u001dÁ\u0002b\b\u0016\u0010C°\u0080\u0018\u0082\u0005Ä\u0010, \u0086`\u00011\u0004\v\u0088!X@\fÁ\u0002b\b\u0016\u0010C°\u0080\u0018\u0082\u0005Ä\u0010, \u0086`\u00011\u0004\v\u0088!X@\fÁ\u0002b\b\u0016\u0010C°\u0080\u0018\u0082\u0005Ä\u0010, \u0086`\u00011\u0004\v\u0088!X@\fÁ\u0002b\b\u0016\u0010C°\u0080\u0018\u0082\u0005Ä\u0010, \u0086`\u00011\u0004\v\u0088!X@\fÁ\u0002b\b\u0016\u0010C°\u0080\u0018\u0082\u0005Ä\u0010, \u0086`\u00011\u0004\v\u0088!X@\fÁ\u0002b\b\u0016\u0010C°\u0080\u0018\u0082\u0005Ä\u0010, \u0086`\u00011\u0004\v\u0088!X@\fÁ\u0002b\b\u0016\u0010C°\u0080\u0018\u0082\u0005Ä\u0010, \u0086`\u00011\u0004\v\u0088!X@\fÁ\u0002b\b\u0016\u0010C°\u0080\u0018\u0082\u0005Ä\u0010, \u0086`\u00011\u0004\v\u0088!X@\fÁ\u0002b\b\u0016\u0010C°\u0080\u0018\u0082\u0005Ä\u0010, \u0086`\u00011\u0004\v\u0088!X@\fÁ\u0002b\b\u0016\u0010C°\u0080\u0018\u0082\u0005Ä\u0010, \u0086`\u00011\u0004\v\u0088!X@\fÁ\u0002b\b\u0016\u0010C°\u0080\u0018\u0082\u0005Ä\u0010, \u0086`\u00011\u0004\v\u0088!X@\fÁ\u0002b\b\u0016\u0010C°\u0080\u0018\u0082\u0005Ä\u0010, \u0086`\u00011\u0004\v\u0088!X@\fÁ\u0002b\b\u0016\u0010C°\u0080\u0018\u0082\u0005Ä\u0010, \u0086`\u00011\u0004\v\u0088!X@\fÁ\u0002b\b\u0016\u0010C°\u0080\u0018\u0082\u0005Ä\u0010, \u0086`\u00011\u0004\v\u0088!X@\fÁ\u0002b\b\u0016\u0010C°\u0080\u0018\u0082\u0005Ä\u0010, \u0086`\u00011\u0004\v\u0088!X@\fÁ\u0002b\b\u0016\u0010C°\u0080\u0018\u0082\u0005Ä\u0010, \u0086`\u00011\u0004\v\u0088ÑÁZ­O\u0002ÌÐª\u0083u±6\t0G\u0097\u001d¬÷k\u0093\0stÞÁz5¾\\\u008d+À\u009cLm:é`=/·å~L\u0002ÌI·é®\u001c.zÔ\u0087Ó±p3®\0sðm\\Ï~ÆªG}Ù+\u009fÇÂõ¸\u0002ìÒÔ¢/e\u007fäêaÔÄq¹\u001c\u001b\u009c´\u0080]\u009aNVÝ¤ã\u0091©Ç£\u0017ÊtÒêûF\u000fâ\u0081§ÔÍ\u0099\u009e§÷Éjs¬¦Q\u001böËYé\u0087\\ëÿ\f`Ûº=Ý Ç·\u0081\u007f\u001bµù°\u009c\u0094óÒÇ2oÄ\u0003ÛÐméÆtkº9\u000f¿\u0006þ6\u0016\u008b\u001fþ\u0086y¸×\u0082&ª\0\0\0\0IEND®B`\u0082";
        public const string Bytes_ButtonBG_Selected = "\u0089PNG\r\n\u001a\n\0\0\0\rIHDR\0\0\u0001,\0\0\0\u0096\b\u0006\0\0\0d[µÒ\0\0\u0001\u0082iCCPICC profile\0\0(Ï\u0095\u0091;H\u0003A\u0018\u0084¿$\u008a\"\u0011\u0005S\u0088X\\\u0011­L£\"\u0096\u0012E\u0011\u0014$F0jáÝÅD!w\u0086»\u0004\u001bKÁV°ðÑø*l¬µµ°\u0015\u0004Á\a\u0088µ\u0085\u0095¢\u008d\u0084óß\u008b\u0090 DpaÙ\u008fÙ\u009daw\u0016\u0082\u00879Órë\u0086À²\vNb,®Í¦æ´\u0086\u0017B\u0084i$J«nºùÉéÑ$5Çç\u001d\u0001µÞÆT\u0016ÿ\u001bÍé%×\u0084\u0080&<dæ\u009d\u0082ð¢ðÀZ!¯xW8b.ëiá3á\u001eG.(ü t£Ì¯\u008a³>\aUfÄI&\u0086\u0085#ÂZ¶\u008a\u008d*6\u0097\u001dK¸_8\u009a¶lÉ\u000fÎ\u00969­x]±\u0095+\u009a?÷T/\f/Ù3ÓJ\u0097ÙÉ\u0018ãL2\u0085\u0086A\u0091\u0015r\u0014\u0088Éj\u008bâ\u0092\u0090ýx\r\u007f\u0087ï\u009f\u0012\u0097!®\u0015Lq\u008c°\u008a\u0085îûQ\u007fð»[7Ó×[N\nÇ¡þÙóÞ» a\u001bJ[\u009e÷uäy¥c\b=Á¥]ñ¯\u001eÂà\u0087è[\u0015-z\0-\u001bp~UÑ\u008c\u001d¸Ø\u0084öÇ¼îè¾\u0014\u0092\u0019ÌdàíT¾)\u0005m7Ð4_îíg\u009f\u0093{HJW\u0013×°·\u000fÝYÉ^¨ñîÆêÞþ<ã÷Gü\u001by#r©Ý\u009cÖò\0\0\0\tpHYs\0\0\u000eÃ\0\0\u000eÃ\u0001Ço¨d\0\0\0\atIME\aè\u0003\f\b%7eèÒw\0\0\u0003dIDATx^íÚAN\u0014A\u0018\u0086áY\nK\u0094\vÀYæ4j8\u0084Â\u0085T\u000e¢Ñ\v ;H$\u0081Ý\u0004ý\u007f©\u008ea\u001cuã0ý%O%Oz¦ª`ù¦º§\u0017\u007f\u001aËåò ¼,ïÊEY\u0095ï\0ÿY·¥\u001bÓ­éæ\u001c\u008c\fý{ÔægåM¹-\u009bþ9À6u{Þ\u0096½\u0091¥Í£6\u001c\u0095\u008f¥ÿè¾\\\u008dÏ\0O¡\u009bÓíéÏ\u009fÊÑÈÓãÑ\vårl¼\u0019W\u0080]\u0098\u001aÔM:\u001e\u0099z\u00185Ñ·\u0081ÓÉêz\\\u0001vijQ\u009f´~Ý\u001eÖ\u0097~fÕ\vNVÀ\u009cLM:\u009dbÕ¿\u0006öC®é¾\u0011`NºMwåE\a«\u007fFìI\u000fØ\u00819\u009aÚôº\u0083Õï>¬o\0\u0098\u009b\u000f\u001d¬~akÓ\"À\u009c|í`y\u0083\u001dH°ê`mZ\0\u0098\u001dÁ\u0002b\b\u0016\u0010C°\u0080\u0018\u0082\u0005Ä\u0010, \u0086`\u00011\u0004\v\u0088!X@\fÁ\u0002b\b\u0016\u0010C°\u0080\u0018\u0082\u0005Ä\u0010, \u0086`\u00011\u0004\v\u0088!X@\fÁ\u0002b\b\u0016\u0010C°\u0080\u0018\u0082\u0005Ä\u0010, \u0086`\u00011\u0004\v\u0088!X@\fÁ\u0002b\b\u0016\u0010C°\u0080\u0018\u0082\u0005Ä\u0010, \u0086`\u00011\u0004\v\u0088!X@\fÁ\u0002b\b\u0016\u0010C°\u0080\u0018\u0082\u0005Ä\u0010, \u0086`\u00011\u0004\v\u0088!X@\fÁ\u0002b\b\u0016\u0010C°\u0080\u0018\u0082\u0005Ä\u0010, \u0086`\u00011\u0004\v\u0088!X@\fÁ\u0002b\b\u0016\u0010C°\u0080\u0018\u0082\u0005Ä\u0010, \u0086`\u00011\u0004\v\u0088!X@\fÁ\u0002b\b\u0016\u0010C°\u0080\u0018\u0082\u0005Ä\u0010, \u0086`\u00011\u0004\v\u0088!X@\fÁ\u0002b\b\u0016\u0010C°\u0080\u0018\u0082\u0005Ä\u0010, \u0086`\u00011\u0004\v\u0088!X@\fÁ\u0002b\b\u0016\u0010C°\u0080\u0018\u0082\u0005Ä\u0010, \u0086`\u00011\u0004\v\u0088!X@\fÁ\u0002b\b\u0016\u0010C°\u0080\u0018\u0082\u0005Ä\u0010, \u0086`\u00011\u0004\v\u0088!X@\fÁ\u0002b\b\u0016\u0010C°\u0080\u0018\u0082\u0005Ä\u0010, \u0086`\u00011\u0004\v\u0088!X@\fÁ\u0002b\b\u0016\u0010C°\u0080\u0018\u0082\u0005Ä\u0010, \u0086`\u00011\u0004\v\u0088!X@\fÁ\u0002b\b\u0016\u0010C°\u0080\u0018\u0082\u0005Ä\u0010, \u0086`\u00011\u0004\v\u0088!X@\fÁ\u0002b\b\u0016\u0010C°\u0080\u0018\u0082\u0005Ä\u0010, \u0086`\u00011\u0004\v\u0088!X@\fÁ\u0002b\b\u0016\u0010C°\u0080\u0018\u0082\u0005Ä\u0010, \u0086`\u00011\u0004\v\u0088ÑÁZ­O\u0002ÌÐª\u0083u±6\t0G\u0097\u001d¬÷k\u0093\0stÞÁz5¾\\\u008d+À\u009cLm:é`=/·å~L\u0002ÌI·é®\u001c.zÔ\u0087Ó±p3®\0sðm\\Ï~ÆªG}Ù+\u009fÇÂõ¸\u0002ìÒÔ¢/e\u007fäêaÔÄq¹\u001c\u001b\u009c´\u0080]\u009aNVÝ¤ã\u0091©Ç£\u0017ÊtÒêûF\u000fâ\u0081§ÔÍ\u0099\u009e§÷Éjs¬¦Q\u001böËYé\u0087\\ëÿ\f`Ûº=Ý Ç·\u0081\u007f\u001bµù°\u009c\u0094óÒÇ2oÄ\u0003ÛÐméÆtkº9\u000f¿\u0006þ6\u0016\u008b\u001f¤Ë­¹®Oî5\0\0\0\0IEND®B`\u0082";

        public static byte[] StringToBytes(string str)
        {
            List<byte> bytes = new List<byte>();

            foreach (char c in str)
            {
                bytes.Add((byte)c);
            }

            return bytes.ToArray();
        }

        public static byte[] ImageToBytes(System.Drawing.Image imageIn)
        {
            using (var ms = new MemoryStream())
            {
                imageIn.Save(ms, imageIn.RawFormat);
                return ms.ToArray();
            }
        }

        public static Stream BytesToStream(byte[] bytes)
        {
            MemoryStream stream = new MemoryStream();
            stream.Write(bytes, 0, bytes.Length);
            return stream;
        }

        //public static Image ImageFromMemory
    }
}
